export function getData() {
  return {
    length: 6,
    onboarding: 0,
    data: {
      M:[
        {key:'状态',value:'POWER_OFF'},
        {key:'帐户状态',value:'LOGOUT'},
        {key:'RSSI',value:'111'},
        {key:'NSQ',value:'差'},
      ],
      G:[
        {key:'驻网PLMN',value:'46011'},
        {key:'UIM卡 imsi',value:'460111136700532'},
        {key:'UIM卡状态',value:'READY'},
        {key:'网络类型',value:'LTE'},
        {key:'RSSI ',value:'100'},
        {key:'CID',value:'125423115'},
        {key:'cs_status',value:''},
        {key:'cs_errno',value:'0'},
        {key:'ps_status',value:'RIL_REG_STATE_HOME'},
        {key:'ps_errno',value:'0'},
      ],
      S:[
        {key:'设备型号',value:'OC10'},
        {key:'IMEI',value:'911346459907775'},
        {key:'Android系统版本',value:''},
        {key:'APP版本',value:''},
        {key:'序列号',value:'713cb890'},
        {key:'基带版本',value:''},
        {key:'内核版本',value:''},
        {key:'ROOM版本',value:'OC_C_CHN_V1.01.32_2018120310_TR_user'},
        {key:'Rumid版本',value:'312e32'}
      ],
      D:[
      {time:'123214142114',imsi:'213123213131',result:'成功'},
      {time:'123214142114',imsi:'213123213131',result:'成功'},
      {time:'123214142114',imsi:'213123213131',result:'成功'},
      {time:'123214142114',imsi:'213123213131',result:'成功'},
      {time:'123214142114',imsi:'213123213131',result:'成功'},
      {time:'123214142114',imsi:'213123213131',result:'成功'},
      {time:'123214142114',imsi:'213123213131',result:'成功'},
      {time:'123214142114',imsi:'213123213131',result:'成功'},
      {time:'123214142114',imsi:'213123213131',result:'成功'},
      {time:'123214142114',imsi:'213123213131',result:'成功'},
      {time:'123214142114',imsi:'213123213131',result:'成功'},
      ],
      L:[
        {'时间':'2019-01-14 01:12:56','IMEI':911346459907585,IP:'/183.15.177.185:43921','型号':	'OC10','结果':'成功'},
        {'时间':'2019-01-14 01:12:56','IMEI':911346459907585,IP:'/183.15.177.185:43921','型号':	'OC10','结果':'成功'},
        {'时间':'2019-01-14 01:12:56','IMEI':911346459907585,IP:'/183.15.177.185:43921','型号':	'OC10','结果':'成功'},
        {'时间':'2019-01-14 01:12:56','IMEI':911346459907585,IP:'/183.15.177.185:43921','型号':	'OC10','结果':'成功'},
        {'时间':'2019-01-14 01:12:56','IMEI':911346459907585,IP:'/183.15.177.185:43921','型号':	'OC10','结果':'成功'},
        {'时间':'2019-01-14 01:12:56','IMEI':911346459907585,IP:'/183.15.177.185:43921','型号':	'OC10','结果':'成功'},
        {'时间':'2019-01-14 01:12:56','IMEI':911346459907585,IP:'/183.15.177.185:43921','型号':	'OC10','结果':'成功'},
        {'时间':'2019-01-14 01:12:56','IMEI':911346459907585,IP:'/183.15.177.185:43921','型号':	'OC10','结果':'成功'},
        {'时间':'2019-01-14 01:12:56','IMEI':911346459907585,IP:'/183.15.177.185:43921','型号':	'OC10','结果':'成功'},
        {'时间':'2019-01-14 01:12:56','IMEI':911346459907585,IP:'/183.15.177.185:43921','型号':	'OC10','结果':'成功'},
      ]
    },
    table:[
      {Mcc:'123214142114',Mnc:'213123213131',int:'M网',wifi:'强'},
      {Mcc:'123214142114',Mnc:'213123213131',int:'M网',wifi:'强'},
      {Mcc:'123214142114',Mnc:'213123213131',int:'M网',wifi:'强'},
      {Mcc:'123214142114',Mnc:'213123213131',int:'M网',wifi:'强'},
      {Mcc:'123214142114',Mnc:'213123213131',int:'M网',wifi:'强'},
      {Mcc:'123214142114',Mnc:'213123213131',int:'M网',wifi:'强'},
      {Mcc:'123214142114',Mnc:'213123213131',int:'M网',wifi:'强'},
      {Mcc:'123214142114',Mnc:'213123213131',int:'M网',wifi:'强'},
      {Mcc:'123214142114',Mnc:'213123213131',int:'M网',wifi:'强'},
    ]
  }
}