export function getData() {
  return{
    dialog:true,
    dateRangeOptions:{
    },
    isShow:false,
    items: [
        '中国',
        '韩国',
        '越南',
    ],
    data: [
      {id:0,name:'张三',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'4564988111177566',state:0},
      {id:1,name:'李四',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'1111188079877566',state:1},
      {id:2,name:'张三',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'1114988079877566',state:2},
      {id:3,name:'李四',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'1164988079877566',state:3},
      {id:4,name:'王五',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11164988079877566',state:4},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
      {id:5,name:'赵六',phone:'13333333333',ip:'127.156.155.015:8000',position:'中国',time:'2018-12-15 06:08:09',IMEI:'138978718645456',IMSI:'11111111079877566',state:5},
    ],
    state:[
      {state:0,name:'RTU模式',color:'#26c6da'},
      {state:1,name:'已登录',color:'#006699'},
      {state:2,name:'待分卡',color:'#ff6699'},
      {state:3,name:'已分卡',color:'#ff9955'},
      {state:4,name:'Ready',color:'#66cc33'},
      {state:5,name:'未知/离线',color:'#99cccc'},
    ],
    valid: false,
    firstname: '',
    lastname: '',
    menuList:[
      {title:"强制下线"},
      {title:"强制换卡"},
      {title:"强制还卡"},
      {title:"绑卡/解绑"},
      {title:"开启RTU模式"},
      {title:"打开Trace"},
      {title:"提取日志"},
      {title:"查看日志"},
      ],
    nameRules: [
      v => !!v || '请输入用户名',
      v => v.length <= 10 || '用户名不能大于10位'
    ],
    email: '',
    emailRules: [
      v => !!v || 'E-mail is required',
      v => /.+@.+/.test(v) || 'E-mail must be valid'
    ],
  }
}